Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

list1 = [4,8,15,16,23,42]
series = pd.Series(list1)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
import pandas as pd
list2 = [x for x in range(2,21,2)]

series2 = pd.Series(list2)
series2

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name    Age    Gender
Alice   25     Female
Bob     30     Male
Claire  27     Female

Then, print the DataFrame.

In [2]:
data = {"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

import pandas as pd
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Difference between a pandas series and dataframe are:
Series is one dimensional, but dataframe is multidimensional
Series contain homogenous data, but dataframe contain heterogenous data
Size of a series is immutable, but size of a dataframe can be changes.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [15]:
import pandas as pd

data1 = {"Subjects":["English","Hindi","Maths","Science"],"Student1":[10,9,8,7],"Student2":[8,9,10,7],"Student3":[8,8,9,7]}
df3 = pd.DataFrame(data1)

print(df3.head())
print(df3.describe())
print(df3.shape)

  Subjects  Student1  Student2  Student3
0  English        10         8         8
1    Hindi         9         9         8
2    Maths         8        10         9
3  Science         7         7         7
        Student1   Student2  Student3
count   4.000000   4.000000  4.000000
mean    8.500000   8.500000  8.000000
std     1.290994   1.290994  0.816497
min     7.000000   7.000000  7.000000
25%     7.750000   7.750000  7.750000
50%     8.500000   8.500000  8.000000
75%     9.250000   9.250000  8.250000
max    10.000000  10.000000  9.000000
(4, 4)

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All three Series, DataFrame, and Panel are value mutable, but Series is not size mutable, but we can change of DataFrame and Panel

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [13]:
import pandas as pd

l1 = ["Science","Maths","English","Hindi"]
l2 = [48,47,49,45]
l3 = [42,41,43,44]
l4 = [44,40,41,40]

s1 = pd.Series(l1)
s2 = pd.Series(l2)
s3 = pd.Series(l3)
s4 = pd.Series(l4)

df = pd.DataFrame({"Subjects":s1,"Student1_Marks":s2,"Student_Marks":s3,"Student3_Marks":s4})
df

  Subjects  Student1_Marks  Student_Marks  Student3_Marks
0  Science              48             42              44
1    Maths              47             41              40
2  English              49             43              41
3    Hindi              45             44              40